OpenFOAM-3.0.1/chapter4/multiRegionHeaterFine/constant/heater/readMe.txt
OpenFOAM-2.2.0 uses thermoPhesicalProperties 
previous versions use solidThermoPhesicalProperties
